app/Controllers/Home.php

SELECT *
FROM `transaksi`
WHERE `date` = '2023-11-20'
SELECT COUNT(*) AS `numrows`
FROM `transaksi`
WHERE `date` = '2023-11-20'
SELECT *
FROM `transaksi`
WHERE `date` = '2023-11-14'
---
    public function index(): string
    {
        $transModel = new TransaksiModel();
        $date = date('Y-m-d');
        $today = $transModel->where('date', $date)->findAll();
        $sales = $transModel->where('date', $date)->countAllResults();
        if ($sales == 0) {
            $sls = $sales;
        } else {
            $sls = $sales - 1;
        }


        $todayRev = 0;
        foreach ($today as $key) {
            $todayRev += $key['total_final'];
        }

        $labelWeek = array();
        $batas = 6;
        $isiWeek = array();
        $salesWeek = array();
        $d = 0;
        while ($batas >= 0) {
            // Buat label dashboard week
            $valWeek = 0;
            array_push($labelWeek, date('Y-m-d', strtotime($batas . ' days ago')));

            // buat dashboard week revenue
            $isi = $transModel->where('date', $labelWeek[$d])->findAll();